{
    "architectures": [
        "Qwen2VLForConditionalGeneration"
    ],
    "bos_token_id": null,
    "torch_dtype": "bfloat16",
    "eos_token_id": 151645,
    "image_token_id": 151655,
    "model_name": "unsloth/qwen2-vl-7b-instruct-unsloth-bnb-4bit",
    "model_type": "qwen2_vl",
    "pad_token_id": 151654,
    "text_config": {
        "attention_dropout": 0.0,
        "bos_token_id": 151643,
        "torch_dtype": "bfloat16",
        "eos_token_id": 151645,
        "hidden_act": "silu",
        "hidden_size": 3584,
        "initializer_range": 0.02,
        "intermediate_size": 18944,
        "layer_types": [
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention"
        ],
        "max_position_embeddings": 32768,
        "max_window_layers": 28,
        "model_type": "qwen2_vl_text",
        "num_attention_heads": 28,
        "num_hidden_layers": 28,
        "num_key_value_heads": 4,
        "pad_token_id": 151654,
        "rms_norm_eps": 1e-06,
        "rope_parameters": {
            "mrope_section": [
                16,
                24,
                24
            ],
            "rope_theta": 1000000.0,
            "rope_type": "default",
            "type": "default"
        },
        "sliding_window": null,
        "use_cache": true,
        "use_sliding_window": false,
        "vocab_size": 152064
    },
    "tie_word_embeddings": false,
    "unsloth_fixed": true,
    "unsloth_version": "2026.3.4",
    "use_cache": false,
    "video_token_id": 151656,
    "vision_config": {
        "depth": 32,
        "torch_dtype": "bfloat16",
        "embed_dim": 1280,
        "hidden_act": "quick_gelu",
        "hidden_size": 3584,
        "in_channels": 3,
        "in_chans": 3,
        "initializer_range": 0.02,
        "mlp_ratio": 4,
        "model_type": "qwen2_vl",
        "num_heads": 16,
        "patch_size": 14,
        "spatial_merge_size": 2,
        "spatial_patch_size": 14,
        "temporal_patch_size": 2
    },
    "vision_end_token_id": 151653,
    "vision_start_token_id": 151652,
    "vision_token_id": 151654
}